<img src = "../../images/3_logos.png" width = 600, align = "center">
<br>
<h1 align=center><font size = 5>Régiment</font></h1>
<h2 align=center><font size = 5>Grouper</font></h2>

### Introduction:

On reprend le jeu de données de la partie 1

### 1. Importer les librairies nécessaires

In [1]:
import pandas as pd 
import numpy as np

### 2. Créer un dataFrame "Army" à partir du dictionnaire suivant en tenant compte des entêtes des colonnes :

In [2]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

In [3]:
Army = pd.DataFrame({'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]})
Army.head()

     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
4    Dragoons     1st     Cooze             3             70

### 3. Quel est la moyenne de "preTestScore" pour les "Nighthawks" ?

In [4]:
#Army[Army['preTestScore'].mean()][Army[Army['regiment'] == 'Nighthawks']]
Army[Army['regiment']== 'Nighthawks']['preTestScore'].mean()

15.25

### 4. Afficher les statistiques générales pour chaque "compagny"

In [5]:
Army.groupby(['company']).describe()

        postTestScore                                                       \
                count       mean        std   min    25%   50%   75%   max
company
1st               6.0  57.666667  27.485754  25.0  34.25  66.0  70.0  94.0
2nd               6.0  67.000000  14.057027  57.0  58.25  62.0  68.0  94.0

        preTestScore
               count       mean        std  min   25%   50%    75%   max
company
1st              6.0   6.666667   8.524475  2.0  3.00   3.5   4.00  24.0
2nd              6.0  15.500000  14.652645  2.0  2.25  13.5  29.25  31.0

### 5. Quelle est la moyenne de "preTestScore" pour chaque "compagny" ?

In [6]:
#Army.groupby(['company']).describe()
Army['preTestScore'].groupby(Army['company']).describe()

         count       mean        std  min   25%   50%    75%   max
company
1st        6.0   6.666667   8.524475  2.0  3.00   3.5   4.00  24.0
2nd        6.0  15.500000  14.652645  2.0  2.25  13.5  29.25  31.0

### 6.Afficher les moyennes de "preTestScore" pour chaque "regiment" et "compagny"

In [7]:
Army.groupby(['company','regiment']).mean()['preTestScore']

company  regiment
1st      Dragoons       3.5
         Nighthawks    14.0
         Scouts         2.5
2nd      Dragoons      27.5
         Nighthawks    16.5
         Scouts         2.5
Name: preTestScore, dtype: float64

### 7. Afficher les moyennes de "preTestScore" grouppées par "regiment" et "compagny" sans index hierarchique.

In [8]:
Army.groupby(['company','regiment'],).mean()['preTestScore']
Army.groupby(['company','regiment'],as_index=False).mean()['preTestScore']

0     3.5
1    14.0
2     2.5
3    27.5
4    16.5
5     2.5
Name: preTestScore, dtype: float64

##### 8. Grouper le dataFrame par "regiment" et "compagny"

In [9]:
#Army.groupby(['company','regiment']).head()
Army.groupby(['company','regiment']).describe()
#Army.groupby(['company','regiment']).mean()

                   postTestScore                                             \
                           count  mean        std   min    25%   50%    75%
company regiment
1st     Dragoons             2.0  47.5  31.819805  25.0  36.25  47.5  58.75
        Nighthawks           2.0  59.5  48.790368  25.0  42.25  59.5  76.75
        Scouts               2.0  66.0   5.656854  62.0  64.00  66.0  68.00
2nd     Dragoons             2.0  75.5  26.162951  57.0  66.25  75.5  84.75
        Nighthawks           2.0  59.5   3.535534  57.0  58.25  59.5  60.75
        Scouts               2.0  66.0   5.656854  62.0  64.00  66.0  68.00

                         preTestScore                                      \
                     max        count  mean        std   min    25%   50%
company regiment
1st     Dragoons    70.0          2.0   3.5   0.707107   3.0   3.25   3.5
        Nighthawks  94.0          2.0  14.0  14.142136   4.0   9.00  14.0
        Scouts      70.0          2.0   2.5   0.707107   2.0   2.25   2.5
2nd     Dragoons    94.0          2.0  27.5   4.949747  24.0  25.75  27.5
        Nighthawks  62.0          2.0  16.5  20.506097   2.0   9.25  16.5
        Scouts      70.0          2.0   2.5   0.707107   2.0   2.25   2.5


                      75%   max
company regiment
1st     Dragoons     3.75   4.0
        Nighthawks  19.00  24.0
        Scouts       2.75   3.0
2nd     Dragoons    29.25  31.0
        Nighthawks  23.75  31.0
        Scouts       2.75   3.0

### S9. Combien y a t-il d'observation pour chaque "regiment" et pour chaque "compagny"

In [10]:
Army['regiment'].shape
Army['company'].shape

(12,)

### 10. Iterer sur un groupe et afficher le nom puis l'integralité des données d'un regiment.

In [11]:
for row in Army.itertuples(index=True, name='Pandas'):
    print (getattr(row, "name"), getattr(row, "regiment"))

Miller Nighthawks
Jacobson Nighthawks
Ali Nighthawks
Milner Nighthawks
Cooze Dragoons
Jacon Dragoons
Ryaner Dragoons
Sone Dragoons
Sloan Scouts
Piger Scouts
Riani Scouts
Ali Scouts

<hr>
Copyright &copy; 2018 Hatem & Driss @NEEDEMAND

In [12]:
Army

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

In [13]:
Army.apply(lambda x: [len(x) for i in x])
Army.head()

     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
4    Dragoons     1st     Cooze             3             70

In [14]:
Army1=Army
Army1.set_index('name', inplace=True)
print(Army1)

            regiment company  preTestScore  postTestScore
name
Miller    Nighthawks     1st             4             25
Jacobson  Nighthawks     1st            24             94
Ali       Nighthawks     2nd            31             57
Milner    Nighthawks     2nd             2             62
Cooze       Dragoons     1st             3             70
Jacon       Dragoons     1st             4             25
Ryaner      Dragoons     2nd            24             94
Sone        Dragoons     2nd            31             57
Sloan         Scouts     1st             2             62
Piger         Scouts     1st             3             70
Riani         Scouts     2nd             2             62
Ali           Scouts     2nd             3             70

In [15]:
print(Army1)

            regiment company  preTestScore  postTestScore
name
Miller    Nighthawks     1st             4             25
Jacobson  Nighthawks     1st            24             94
Ali       Nighthawks     2nd            31             57
Milner    Nighthawks     2nd             2             62
Cooze       Dragoons     1st             3             70
Jacon       Dragoons     1st             4             25
Ryaner      Dragoons     2nd            24             94
Sone        Dragoons     2nd            31             57
Sloan         Scouts     1st             2             62
Piger         Scouts     1st             3             70
Riani         Scouts     2nd             2             62
Ali           Scouts     2nd             3             70